tylertms/dspic33e-sim/conformance/uart.c
static void receive_value_domain(UartConformance* state, Dspic33* cpu) {
    static const uint16_t selections[] = {0u, 2u, 4u, 6u};
    uint8_t channel;
    uint8_t selection;
    uint16_t value;
    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        for (selection = 0u; selection < 4u; selection++) {
            uint16_t mode = (uint16_t)(0x8000u | selections[selection]);
            dspic33_reset(cpu, 0u);
            configure(cpu, channel, mode, 0u, 0u);
            for (value = 0u; value <= 0x01ffu; value++) {
                Dspic33UartFrame frame;
                uint16_t expected =
                    mode_data_bits(mode) == 9u ? value : value & 0x00ffu;
                memset(&frame, 0, sizeof(frame));
                frame.value = value;
                expect(state, receive_frame(cpu, channel, &frame, 0u),
                       "receive value schedule");
                expect(state,
                       (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                        0x001du) == 0x0011u,
                       "receive value status");
                expect(state,
                       dspic33_read_word(cpu, (uint16_t)(bases[channel] + 6u)) ==
                           expected,
                       "receive value domain");
            }
        }
    }
}

static void transmit_value_domain(UartConformance* state, Dspic33* cpu) {
    static const uint16_t selections[] = {0u, 2u, 4u, 6u};
    uint8_t channel;
    uint8_t selection;
    uint16_t value;
    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        for (selection = 0u; selection < 4u; selection++) {
            uint16_t mode = (uint16_t)(0x8000u | selections[selection]);
            uint64_t cycles;
            Dspic33UartFrame expected_frame;
            dspic33_reset(cpu, 0u);
            configure(cpu, channel, mode, 0x0400u, 0u);
            memset(&expected_frame, 0, sizeof(expected_frame));
            expected_frame.data_bits = mode_data_bits(mode);
            expected_frame.stop_bits = 1u;
            expected_frame.parity = mode_parity(mode);
            cycles = frame_cycles(mode, 0u, &expected_frame);
            for (value = 0u; value <= 0x01ffu; value++) {
                Dspic33UartFrame output;
                dspic33_write_word(cpu, (uint16_t)(bases[channel] + 4u), value);
                expect(state, dspic33_device_advance(cpu, cycles),
                       "transmit value advance");
                expect(state, dspic33_uart_transmit(cpu, channel, &output),
                       "transmit value available");
                expect(state,
                       output.value ==
                               (mode_data_bits(mode) == 9u ? value : value & 0x00ffu) &&
                           output.data_bits == mode_data_bits(mode) &&
                           output.stop_bits == 1u &&
                           output.parity == mode_parity(mode) && !output.inverted &&
                           !output.irda && !output.break_signal,
                       "transmit value domain");
            }
        }
    }
}

static void receive_fifo_cases(UartConformance* state, Dspic33* cpu) {
    uint8_t threshold_mode;
    uint8_t index;
    for (threshold_mode = 0u; threshold_mode < 4u; threshold_mode++) {
        uint8_t threshold = threshold_mode < 2u ? 1u : (threshold_mode == 2u ? 3u : 4u);
        dspic33_reset(cpu, 0u);
        configure(cpu, 0u, 0x8000u, (uint16_t)(threshold_mode << 6u), 0u);
        clear_interrupt(cpu, receive_irqs[0]);
        for (index = 0u; index < threshold; index++) {
            Dspic33UartFrame frame;
            memset(&frame, 0, sizeof(frame));
            frame.value = (uint16_t)(0x40u + index);
            expect(state, receive_frame(cpu, 0u, &frame, 0u),
                   "receive threshold schedule");
            expect(state,
                   interrupt_flag(cpu, receive_irqs[0]) == (index + 1u >= threshold),
                   "receive interrupt threshold");
        }
    }

    {
        uint8_t channel;
        for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
            dspic33_reset(cpu, 0u);
            configure(cpu, channel, 0x8000u, 0u, 0u);
            clear_interrupt(cpu, error_irqs[channel]);
            for (index = 0u; index < 6u; index++) {
                Dspic33UartFrame frame;
                memset(&frame, 0, sizeof(frame));
                frame.value = (uint16_t)(0x70u + index);
                expect(state, receive_frame(cpu, channel, &frame, 0u),
                       "receive overrun schedule");
            }
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                    0x0002u) != 0u,
                   "receive overrun status");
            expect(state, interrupt_flag(cpu, error_irqs[channel]),
                   "receive overrun interrupt");
            for (index = 0u; index < 5u; index++) {
                expect(state,
                       dspic33_read_word(cpu, (uint16_t)(bases[channel] + 6u)) ==
                           (uint16_t)(0x70u + index),
                       "receive overrun held ordering");
            }
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                    0x0003u) == 0x0002u,
                   "receive overrun persists after reads");
            dspic33_write_word(cpu, (uint16_t)(bases[channel] + 2u), 0u);
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                    0x0003u) == 0u,
                   "receive overrun clear resets FIFO");
            {
                Dspic33UartFrame frame;
                memset(&frame, 0, sizeof(frame));
                frame.value = 0x7fu;
                expect(state, receive_frame(cpu, channel, &frame, 0u),
                       "receive overrun recovery schedule");
                expect(state,
                       dspic33_read_word(cpu, (uint16_t)(bases[channel] + 6u)) ==
                           frame.value,
                       "receive overrun recovery value");
            }

            dspic33_reset(cpu, 0u);
            configure(cpu, channel, 0x8000u, 0u, 0u);
            for (index = 0u; index < 6u; index++) {
                Dspic33UartFrame frame;
                memset(&frame, 0, sizeof(frame));
                frame.value = (uint16_t)(0x60u + index);
                expect(state, receive_frame(cpu, channel, &frame, 0u),
                       "receive populated overrun schedule");
            }
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                    0x0003u) == 0x0003u,
                   "receive populated overrun status");
            expect(state, cpu->io.uart_rx_fifo[channel].count == 4u,
                   "receive populated overrun FIFO depth");
            expect(state, (cpu->io.uart_rx_hold_valid & (uint8_t)(1u << channel)) != 0u,
                   "receive populated overrun held value");
            dspic33_write_word(cpu, (uint16_t)(bases[channel] + 2u), 0u);
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                    0x0003u) == 0u,
                   "receive populated overrun clear status");
            expect(state, cpu->io.uart_rx_fifo[channel].count == 0u,
                   "receive populated overrun clear FIFO");
            expect(state, (cpu->io.uart_rx_hold_valid & (uint8_t)(1u << channel)) == 0u,
                   "receive populated overrun clear held value");
            {
                Dspic33UartFrame frame;
                memset(&frame, 0, sizeof(frame));
                frame.value = 0x5du;
                expect(state, receive_frame(cpu, channel, &frame, 0u),
                       "receive populated overrun recovery schedule");
                expect(state,
                       dspic33_read_word(cpu, (uint16_t)(bases[channel] + 6u)) ==
                           frame.value,
                       "receive populated overrun recovery value");
                expect(state,
                       (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                        0x0001u) == 0u,
                       "receive populated overrun recovery empty");
            }
        }
    }
}

static void receive_access_width_cases(UartConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        Dspic33UartFrame frame;
        uint16_t address = (uint16_t)(bases[channel] + 6u);
        dspic33_reset(cpu, 0u);
        configure(cpu, channel, 0x8000u, 0u, 0u);
        memset(&frame, 0, sizeof(frame));
        frame.value = 0x51u;
        expect(state, receive_frame(cpu, channel, &frame, 0u),
               "eight bit byte read first schedule");
        frame.value = 0x52u;
        expect(state, receive_frame(cpu, channel, &frame, 0u),
               "eight bit byte read second schedule");
        expect(state, cpu->io.uart_rx_fifo[channel].count == 2u,
               "eight bit byte read initial depth");
        expect(state, dspic33_read_byte(cpu, address) == 0x51u,
               "eight bit low byte first value");
        expect(state, cpu->io.uart_rx_fifo[channel].count == 1u,
               "eight bit low byte first pop");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) & 0x0001u) !=
                   0u,
               "eight bit low byte remaining status");
        expect(state, dspic33_read_byte(cpu, address) == 0x52u,
               "eight bit low byte second value");
        expect(state, cpu->io.uart_rx_fifo[channel].count == 0u,
               "eight bit low byte second pop");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) & 0x0001u) ==
                   0u,
               "eight bit low byte empty status");

        dspic33_reset(cpu, 0u);
        configure(cpu, channel, 0x8006u, 0u, 0u);
        memset(&frame, 0, sizeof(frame));
        frame.value = 0x1a5u;
        expect(state, receive_frame(cpu, channel, &frame, 0u),
               "nine bit word read first schedule");
        frame.value = 0x155u;
        expect(state, receive_frame(cpu, channel, &frame, 0u),
               "nine bit word read second schedule");
        expect(state, cpu->io.uart_rx_fifo[channel].count == 2u,
               "nine bit word read initial depth");
        expect(state, dspic33_read_word(cpu, address) == 0x1a5u,
               "nine bit word read first value");
        expect(state, cpu->io.uart_rx_fifo[channel].count == 1u,
               "nine bit word read first pop");
        expect(state, dspic33_read_word(cpu, address) == 0x155u,
               "nine bit word read second value");
        expect(state, cpu->io.uart_rx_fifo[channel].count == 0u,
               "nine bit word read second pop");
    }
}

