tylertms/dspic33e-sim/conformance/uart.c
static void transmit_mode_cases(UartConformance* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t interrupt_mode;
    Dspic33UartFrame output;
    for (interrupt_mode = 0u; interrupt_mode < 3u; interrupt_mode++) {
        uint16_t status =
            (uint16_t)(0x0400u | ((interrupt_mode & 1u) != 0u ? 0x2000u : 0u) |
                       ((interrupt_mode & 2u) != 0u ? 0x8000u : 0u));
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, bases[0], 0x8000u);
        clear_interrupt(cpu, transmit_irqs[0]);
        dspic33_write_word(cpu, (uint16_t)(bases[0] + 2u), status);
        expect(state, interrupt_flag(cpu, transmit_irqs[0]),
               "transmit enable interrupt mode");
        clear_interrupt(cpu, transmit_irqs[0]);
        dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0x3cu);
        expect(state,
               interrupt_flag(cpu, transmit_irqs[0]) ==
                   (interrupt_mode == 0u || interrupt_mode == 2u),
               "transmit start interrupt mode");
        clear_interrupt(cpu, transmit_irqs[0]);
        expect(state, dspic33_device_advance(cpu, 160u),
               "transmit interrupt completion advance");
        expect(state, interrupt_flag(cpu, transmit_irqs[0]) == (interrupt_mode == 1u),
               "transmit completion interrupt mode");
        expect(state, dspic33_uart_transmit(cpu, 0u, &output),
               "transmit interrupt output");
    }

    dspic33_reset(cpu, 0u);
    configure(cpu, 0u, 0x9041u, 0x4400u, 0u);
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0x5au);
    expect(state, dspic33_device_advance(cpu, 176u), "loopback advance");
    expect(state,
           dspic33_uart_transmit(cpu, 0u, &output) && output.value == 0x5au &&
               output.stop_bits == 2u && output.inverted && output.irda,
           "loopback transmit metadata");
    expect(state, dspic33_read_word(cpu, (uint16_t)(bases[0] + 6u)) == 0x5au,
           "loopback receive data");

    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, bases[channel], 0x8000u);
        clear_interrupt(cpu, transmit_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 2u), 0x0400u);
        expect(state, interrupt_flag(cpu, transmit_irqs[channel]),
               "transmit enable raises interrupt");
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 4u), 0x5au);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 2u), 0u);
        expect(state,
               dspic33_device_advance(cpu, 1000u) &&
                   !dspic33_uart_transmit(cpu, channel, &output) &&
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                    0x0511u) == 0x0110u,
               "transmit disable aborts and resets transmitter");

        dspic33_reset(cpu, 0u);
        configure(cpu, channel, 0x8000u, 0x0c00u, 0u);
        clear_interrupt(cpu, transmit_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 4u), 0x7eu);
        expect(state, !interrupt_flag(cpu, transmit_irqs[channel]),
               "break transfer suppresses transmit interrupt");
        expect(state, dspic33_device_advance(cpu, 224u), "break advance");
        expect(state,
               dspic33_uart_transmit(cpu, channel, &output) && output.break_signal &&
                   output.value == 0u && output.data_bits == 12u &&
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) &
                    0x0800u) == 0u,
               "break frame and automatic clear");
    }
}

static void b1_transmit_pointer_cases(UartConformance* state, Dspic33* cpu) {
    uint8_t channel;
    Dspic33UartFrame output;
    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        uint16_t value = (uint16_t)(0xa0u + channel);
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, bases[channel], 0x8000u);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 4u), value);
        expect(state,
               cpu->io.uart_tx_fifo[channel].count == 1u &&
                   dspic33_device_advance(cpu, 1000u) &&
                   !dspic33_uart_transmit(cpu, channel, &output),
               "B1 UART accepts TXREG before TXEN without transmitting");
        dspic33_write_word(cpu, bases[channel], 0u);
        expect(state, cpu->io.uart_tx_fifo[channel].count == 1u,
               "B1 UART disable preserves write pointer while TXEN is clear");
        dspic33_write_word(cpu, bases[channel], 0x8000u);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 2u), 0x0400u);
        expect(state,
               dspic33_device_advance(cpu, 160u) &&
                   dspic33_uart_transmit(cpu, channel, &output) &&
                   output.value == value,
               "B1 UART transmits preserved data after TXEN is set");

        dspic33_reset(cpu, 0u);
        configure(cpu, channel, 0x8000u, 0x0400u, 0u);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 4u), value);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 4u),
                           (uint16_t)(value + 0x10u));
        dspic33_write_word(cpu, bases[channel], 0u);
        expect(state,
               cpu->io.uart_tx_fifo[channel].count == 0u &&
                   (cpu->io.uart_tx_active & (uint8_t)(1u << channel)) == 0u,
               "B1 UART disable clears write pointer while TXEN is set");
        dspic33_write_word(cpu, bases[channel], 0x8000u);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 2u), 0x0400u);
        expect(state,
               dspic33_device_advance(cpu, 1000u) &&
                   !dspic33_uart_transmit(cpu, channel, &output),
               "B1 UART cleared write pointer does not transmit stale data");
    }
}

static void cts_cases(UartConformance* state, Dspic33* cpu) {
    Dspic33UartFrame output;
    dspic33_reset(cpu, 0u);
    configure(cpu, 0u, 0x8200u, 0x0400u, 0u);
    expect(state,
           dspic33_uart_set_cts(cpu, 0u, false, 0u) && dspic33_device_advance(cpu, 0u),
           "CTS block schedule");
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0x99u);
    expect(state,
           dspic33_device_advance(cpu, 1000u) &&
               !dspic33_uart_transmit(cpu, 0u, &output),
           "CTS blocks completion");
    expect(state,
           dspic33_uart_set_cts(cpu, 0u, true, 3u) && dspic33_device_advance(cpu, 2u) &&
               !dspic33_uart_transmit(cpu, 0u, &output),
           "CTS delayed release boundary");
    expect(state, dspic33_device_advance(cpu, 1u), "CTS release event");
    expect(state,
           dspic33_device_advance(cpu, 159u) &&
               !dspic33_uart_transmit(cpu, 0u, &output),
           "CTS transmit timing boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_uart_transmit(cpu, 0u, &output) &&
               output.value == 0x99u,
           "CTS release completes transmit");
}

static void dma_cases(UartConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        uint32_t receive_memory = (uint32_t)(0x3000u + channel * 0x20u);
        uint32_t transmit_memory = receive_memory + 2u;
        Dspic33UartFrame frame;
        Dspic33UartFrame output;
        dspic33_reset(cpu, 0u);
        configure_dma(cpu, channel, 0x0001u, receive_irqs[channel], receive_memory,
                      (uint16_t)(bases[channel] + 6u), 0u);
        configure(cpu, channel, 0x8002u, 0u, 0u);
        memset(&frame, 0, sizeof(frame));
        frame.value = (uint16_t)(0x80u + channel);
        frame.parity_error = true;
        expect(state, receive_frame(cpu, channel, &frame, 0u),
               "UART receive DMA schedule");
        expect(state, dspic33_device_advance(cpu, 0u), "UART receive DMA advance");
        expect(state, memory_word(cpu, receive_memory) == (uint16_t)(0x0880u + channel),
               "UART receive DMA data and error bits");

        dspic33_reset(cpu, 0u);
        write_memory_word(cpu, transmit_memory, (uint16_t)(0x1a0u + channel));
        configure_dma(cpu, channel, 0x2001u, transmit_irqs[channel], transmit_memory,
                      (uint16_t)(bases[channel] + 4u), 0u);
        dspic33_write_word(cpu, bases[channel], 0x8006u);
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 2u), 0x0400u);
        expect(state, dspic33_device_advance(cpu, 0u), "UART transmit DMA request");
        expect(state, dspic33_device_advance(cpu, 176u), "UART transmit DMA advance");
        expect(state,
               dspic33_uart_transmit(cpu, channel, &output) &&
                   output.value == (uint16_t)(0x1a0u + channel),
               "UART transmit DMA data");
    }
}

static void physical_pps_cases(UartConformance* state, Dspic33* cpu) {
    static const uint16_t receive_modes[] = {0x8000u, 0x8012u, 0x800cu, 0x801fu};
    static const uint16_t receive_values[] = {0x00a5u, 0x003cu, 0x005au, 0x0155u};
    uint8_t channel;
    bool high = false;
    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        uint16_t mode = receive_modes[channel];
        uint16_t value = receive_values[channel];
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        expect(state, dspic33_gpio_drive(cpu, 3u, 1u, 1u),
               "UART PPS drive receive idle");
        dspic33_write_word(cpu, pps_registers[channel], 64u);
        configure(cpu, channel, mode, 0u, (uint16_t)channel);
        expect(state, drive_uart_level(cpu, true, (mode & 0x0010u) != 0u, 0u),
               "UART PPS establish receive idle");
        expect(state, drive_uart_frame(cpu, mode, (uint16_t)channel, value),
               "UART PPS receive frame timing");
        expect(state, dspic33_read_word(cpu, (uint16_t)(bases[channel] + 6u)) == value,
               "UART PPS receive frame value");
        expect(state, interrupt_flag(cpu, receive_irqs[channel]),
               "UART PPS receive interrupt");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0680u, tx_functions[channel]);
        configure(cpu, channel, 0x8000u, 0x0400u, 0u);
        expect(state, dspic33_gpio_pin(cpu, 3u, 0u, &high) && high,
               "UART PPS transmit idle high");
        dspic33_write_word(cpu, (uint16_t)(bases[channel] + 4u), 0x00a5u);
        expect(state, dspic33_gpio_pin(cpu, 3u, 0u, &high) && !high,
               "UART PPS transmit start bit");
        expect(state,
               dspic33_device_advance(cpu, 16u) &&
                   dspic33_gpio_pin(cpu, 3u, 0u, &high) && high,
               "UART PPS transmit first data bit");
        expect(state,
               dspic33_device_advance(cpu, 16u) &&
                   dspic33_gpio_pin(cpu, 3u, 0u, &high) && !high,
               "UART PPS transmit second data bit");
        expect(state,
               dspic33_device_advance(cpu, 128u) &&
                   dspic33_gpio_pin(cpu, 3u, 0u, &high) && high,
               "UART PPS transmit stop and idle");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_gpio_drive(cpu, 3u, 2u, 2u);
    dspic33_write_word(cpu, pps_registers[0], (uint16_t)(65u << 8u));
    dspic33_write_word(cpu, 0x0680u, tx_functions[0]);
    configure(cpu, 0u, 0x8200u, 0x0400u, 0u);
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0x55u);
    expect(state,
           dspic33_device_advance(cpu, 160u) &&
               !dspic33_uart_transmit(cpu, 0u, &(Dspic33UartFrame){0}),
           "UART PPS high CTS blocks transmit");
    expect(state,
           dspic33_gpio_drive(cpu, 3u, 0u, 2u) && dspic33_device_advance(cpu, 160u),
           "UART PPS low CTS starts transmit");
    {
        Dspic33UartFrame output;
        expect(state, dspic33_uart_transmit(cpu, 0u, &output) && output.value == 0x55u,
               "UART PPS CTS completed value");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0680u, rts_functions[0]);
    configure(cpu, 0u, 0x8100u, 0u, 0u);
    expect(state, dspic33_gpio_pin(cpu, 3u, 0u, &high) && !high,
           "UART PPS flow RTS ready low");
    dspic33_write_word(cpu, bases[0], 0x8900u);
    expect(state, dspic33_gpio_pin(cpu, 3u, 0u, &high) && high,
           "UART PPS simplex RTS empty high");
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 2u), 0x0400u);
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0x33u);
    expect(state, dspic33_gpio_pin(cpu, 3u, 0u, &high) && !high,
           "UART PPS simplex RTS active low");
}

static void physical_lifecycle_cases(UartConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool high = false;
    bool initialized;
    uint16_t mode = 0x8000u;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_gpio_drive(cpu, 3u, 1u, 1u);
    dspic33_write_word(cpu, pps_registers[0], 64u);
    configure(cpu, 0u, 0x8080u, 0u, 0u);
    clear_interrupt(cpu, receive_irqs[0]);
    expect(state,
           dspic33_gpio_drive(cpu, 3u, 0u, 1u) &&
               interrupt_flag(cpu, receive_irqs[0]) &&
               (dspic33_read_word(cpu, bases[0]) & 0x0080u) != 0u,
           "UART PPS wake falling edge interrupts without clearing WAKE");
    expect(state,
           dspic33_gpio_drive(cpu, 3u, 1u, 1u) &&
               (dspic33_read_word(cpu, bases[0]) & 0x0080u) == 0u &&
               (dspic33_read_word(cpu, (uint16_t)(bases[0] + 2u)) & 1u) == 0u,
           "UART PPS wake rising edge clears WAKE without receiving character");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0680u, tx_functions[0]);
    dspic33_gpio_drive(cpu, 3u, 0u, 1u);
    dspic33_write_word(cpu, 0x0e36u, 1u);
    configure(cpu, 0u, mode, 0x0400u, 0u);
    expect(state, dspic33_gpio_pin(cpu, 3u, 0u, &high) && !high,
           "UART PPS open-drain idle releases to external low");
    expect(state,
           dspic33_gpio_drive(cpu, 3u, 1u, 1u) &&
               dspic33_gpio_pin(cpu, 3u, 0u, &high) && high,
           "UART PPS open-drain idle follows external high");
    dspic33_write_word(cpu, 0x0680u, 0u);
    dspic33_write_word(cpu, 0x0e36u, 0u);
    dspic33_write_word(cpu, 0x0e34u, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0u);
    expect(state, dspic33_gpio_pin(cpu, 3u, 0u, &high) && !high,
           "UART PPS remap releases pin to GPIO latch");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0680u, tx_functions[0]);
    dspic33_gpio_drive(cpu, 3u, 1u, 1u);
    configure(cpu, 0u, mode, 0x0400u, 0u);
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0u);
    expect(state, dspic33_gpio_pin(cpu, 3u, 0u, &high) && !high,
           "UART PPS active transmit before PMD");
    dspic33_write_word(cpu, pmd_addresses[0], pmd_masks[0]);
    expect(state,
           dspic33_gpio_pin(cpu, 3u, 0u, &high) && high && cpu->io.uart_tx_active == 0u,
           "UART PPS PMD aborts transmit and releases idle");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0680u, tx_functions[0]);
    configure(cpu, 0u, mode, 0x0400u, 0u);
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0x01u);
    initialized = dspic33_initialize(&copy);
    expect(state, initialized && dspic33_copy(&copy, cpu),
           "UART PPS copy active transmit");
    if (initialized) {
        bool source_high = false;
        bool copy_high = false;
        expect(state,
               dspic33_device_advance(cpu, 16u) && dspic33_device_advance(&copy, 16u) &&
                   dspic33_gpio_pin(cpu, 3u, 0u, &source_high) &&
                   dspic33_gpio_pin(&copy, 3u, 0u, &copy_high) &&
                   source_high == copy_high,
               "UART PPS copied transmit phase matches");
        dspic33_destroy(&copy);
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0680u, tx_functions[0]);
    configure(cpu, 0u, 0x9000u, 0x0400u, 0u);
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0u);
    expect(state,
           dspic33_device_advance(cpu, 6u) && dspic33_gpio_pin(cpu, 3u, 0u, &high) &&
               !high,
           "UART PPS IrDA zero before pulse");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_gpio_pin(cpu, 3u, 0u, &high) &&
               high,
           "UART PPS IrDA zero pulse begins");
    expect(state,
           dspic33_device_advance(cpu, 3u) && dspic33_gpio_pin(cpu, 3u, 0u, &high) &&
               !high,
           "UART PPS IrDA zero pulse ends");
}

static void physical_auto_baud_cases(UartConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_UART_COUNT; channel++) {
        uint16_t mode = (uint16_t)(0x8020u | ((channel & 1u) != 0u ? 8u : 0u));
        uint16_t expected_baud = (uint16_t)(channel + 1u);
        uint64_t clocks = (mode & 8u) != 0u ? 4u : 16u;
        uint64_t bit_cycles = ((uint64_t)expected_baud + 1u) * clocks;
        uint8_t bit;
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_gpio_drive(cpu, 3u, 1u, 1u);
        dspic33_write_word(cpu, pps_registers[channel], 64u);
        configure(cpu, channel, mode, 0u, 0x1234u);
        clear_interrupt(cpu, receive_irqs[channel]);
        expect(state, drive_uart_level(cpu, false, false, bit_cycles),
               "UART PPS auto-baud start edge");
        for (bit = 0u; bit < 8u; bit++) {
            expect(state,
                   drive_uart_level(cpu, (0x55u & (uint8_t)(1u << bit)) != 0u, false,
                                    bit_cycles),
                   "UART PPS auto-baud data edge");
        }
        expect(state, drive_uart_level(cpu, true, false, bit_cycles),
               "UART PPS auto-baud stop edge");
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(bases[channel] + 8u)) ==
                       expected_baud &&
                   (dspic33_read_word(cpu, bases[channel]) & 0x0020u) == 0u &&
                   interrupt_flag(cpu, receive_irqs[channel]),
               "UART PPS auto-baud fifth rising edge result");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 2u)) & 1u) == 0u,
               "UART PPS auto-baud does not populate receive FIFO");
    }
}

