tylertms/dspic33e-sim/conformance/uart.c
static void disable_copy_and_api_cases(UartConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    Dspic33UartFrame frame;
    Dspic33UartFrame first;
    Dspic33UartFrame second;
    bool initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize UART copy");
    if (!initialized) {
        return;
    }
    dspic33_reset(cpu, 0u);
    configure(cpu, 0u, 0x8000u, 0x0400u, 0u);
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0x66u);
    expect(state, dspic33_copy(&copy, cpu), "copy pending UART state");
    expect(state,
           dspic33_device_advance(cpu, 160u) && dspic33_device_advance(&copy, 160u),
           "advance copied UART state");
    expect(state,
           dspic33_uart_transmit(cpu, 0u, &first) &&
               dspic33_uart_transmit(&copy, 0u, &second) &&
               first.value == second.value && first.data_bits == second.data_bits,
           "copied UART output matches");
    dspic33_destroy(&copy);

    dspic33_reset(cpu, 0u);
    configure(cpu, 0u, 0x8000u, 0x0400u, 0u);
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 4u), 0x44u);
    dspic33_write_word(cpu, bases[0], 0u);
    expect(state,
           dspic33_device_advance(cpu, 1000u) &&
               !dspic33_uart_transmit(cpu, 0u, &first),
           "module disable cancels transmit");
    expect(state,
           (dspic33_read_word(cpu, (uint16_t)(bases[0] + 2u)) & 0x0511u) == 0x0110u,
           "module disable resets runtime status");

    memset(&frame, 0, sizeof(frame));
    frame.value = 0x0200u;
    expect(state, !dspic33_uart_receive_frame(cpu, 0u, &frame, 0u),
           "reject receive value outside nine bits");
    frame.value = 0u;
    expect(state, !dspic33_uart_receive_frame(cpu, DSPIC33_UART_COUNT, &frame, 0u),
           "reject receive channel outside range");
    expect(state, !dspic33_uart_receive_frame(cpu, 0u, NULL, 0u),
           "reject null receive frame");
    expect(state, !dspic33_uart_set_cts(cpu, DSPIC33_UART_COUNT, true, 0u),
           "reject CTS channel outside range");
    expect(state, !dspic33_uart_transmit(cpu, DSPIC33_UART_COUNT, &frame),
           "reject transmit channel outside range");
    expect(state, !dspic33_uart_transmit(cpu, 0u, NULL), "reject null transmit frame");
    dspic33_reset(cpu, 0u);
    expect(state,
           cpu->io.uart_tx_active == 0u && cpu->io.uart_tx_scheduled == 0u &&
               cpu->io.uart_rx_hold_valid == 0u && cpu->io.uart_cts == 0x0fu,
           "reset clears UART runtime and releases CTS");
}

int main(void) {
    UartConformance state = {0u, 0u, 0u};
    Dspic33 cpu;
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize UART processor");
    if (initialized) {
        register_cases(&state, &cpu);
        receive_value_domain(&state, &cpu);
        transmit_value_domain(&state, &cpu);
        receive_fifo_cases(&state, &cpu);
        receive_access_width_cases(&state, &cpu);
        receive_error_cases(&state, &cpu);
        special_receive_cases(&state, &cpu);
        transmit_fifo_cases(&state, &cpu);
        transmit_timing_cases(&state, &cpu);
        transmit_mode_cases(&state, &cpu);
        b1_transmit_pointer_cases(&state, &cpu);
        cts_cases(&state, &cpu);
        dma_cases(&state, &cpu);
        physical_pps_cases(&state, &cpu);
        physical_lifecycle_cases(&state, &cpu);
        physical_auto_baud_cases(&state, &cpu);
        disable_copy_and_api_cases(&state, &cpu);
        dspic33_destroy(&cpu);
    }
    report_sfr_side_effect_coverage(
        "uart", uart_sfr_side_effect_coverage,
        SFR_SIDE_EFFECT_COVERAGE_COUNT(uart_sfr_side_effect_coverage),
        state.failed == 0u);
    printf("[uart-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
